# command org-plot/gnuplot (spc m b p)
# src execution = press 'ret' cursor at '#+end_src' (**not execute in insert mode)
#             or  C-c C-c cursor at the line '#+end_src'
#             caution: '#+tblname' has to be position right before table
# '#+TBLFM' execution = same with src execution
#             caution: '#+TBLFM' has to be position right after table
#             choose between 2 formulas: cursor at the line of TBLFM you want, then C-c C-c
* comment & REFs
# https://thearjunmdas.github.io/entries/plot-graphs-in-emacs-org-mode/
# https://orgmode.org/worg/org-tutorials/org-plot.html
# https://orgmode.org/manual/Org-Plot.html
# https://gewhere.github.io/gnuplot-orgmode
# ind: x-axis define
# https://orgmode.org/manual/Editing-and-debugging-formulas.html
# https://orgmode.org/manual/The-Spreadsheet.html
# https://orgmode.org/manual/Tables.html
* Plot
#+CONSTANTS: pi=3.14 eps=2.4e-1
#+tblname: grades
|  1 |  2 |  3 | 11 | 12 | 13 |   8.00 |
|  2 |  3 |  4 | 12 | 13 | 14 |  27.00 |
|  3 |  4 |  5 | 13 | 14 | 15 |  64.00 |
|  4 |  5 |  6 | 14 | 15 | 16 | 125.00 |
|  5 |  6 |  7 | 15 | 16 | 17 | 216.00 |
|  6 |  7 |  8 | 16 | 17 | 18 | 343.00 |
|  7 |  8 |  9 | 17 | 18 | 19 | 512.00 |
|  8 |  9 | 10 | 18 | 19 | 20 | 729.00 |
| 16 | 18 | 20 | 36 | 38 | 40 |  1458. |
#+TBLFM: $7=$2**3;%.2f
#+TBLFM: $7=$2*4/pi
#+TBLFM: @4=@8*2

#+begin_src gnuplot :var data=grades :results output :file ./xy_org2.org.png

        set terminal pngcairo enhanced color font "Arial,48" dashlength 0.5 size 1920,1440
        set border lw 5
        set pointsize 3
        set tics scale 1

        set title "TITLE"

        # https://htmlcolorcodes.com/
        # https://coolors.co/palettes/trending
        color6 = '#264653'
        color7 = '#2a9d8f'
        color8 = '#e9c46a'
        color9 = '#f4a261'
        color10 = '#e76f51'

        set style line 11 dt 1 lw 10 linecolor rgb 'red'
        set style line 12 dt 1 lw 10 linecolor rgb 'magenta'
        set style line 13 dt 1 lw 10 linecolor rgb 'green'
        set style line 14 dt 1 lw 10 linecolor rgb 'blue'
        set style line 15 dt 1 lw 10 linecolor rgb 'purple'
        set style line 16 dt 1 lw 10 linecolor rgb color6
        set style line 17 dt 1 lw 10 linecolor rgb color7
        set style line 18 dt 1 lw 10 linecolor rgb color8
        set style line 19 dt 1 lw 10 linecolor rgb color9
        set style line 20 dt 1 lw 10 linecolor rgb color10

        # margin setup
        set lmargin 7.
        set rmargin 1.
        set tmargin 2.5
        set bmargin 3.
        set key left top


        set ylabel "y"
        set xlabel "x"

        plot data u 1:2 with line linestyle 16 title '',\
        data u 1:3 with linespoints linestyle 17 dt 2 pt 7 ps 5 title '',\
        data u 1:4 with linespoints linestyle 18 pt 8 ps 5 title '',\
        data u 1:5 with linespoints linestyle 19 pt 9 ps 5 title '',\
        data u 1:6 with line linestyle 15 lw 20 title ''
        pause mouse key

#+end_src
